[Killed] BlockStatement
src/auth/auth.service.ts:17:71
     private readonly jwtService: JwtService,
   ) {}
 
-  async register(dto: RegisterDto): Promise<{ access_token: string }> {
-    const existing = await this.usersService.findByEmail(dto.email);
-    if (existing) throw new ConflictException('Email already registered');
-
-    const passwordHash = await bcrypt.hash(dto.password, SALT_ROUNDS);
-    const user = await this.usersService.create(dto.email, passwordHash);
-
-    return { access_token: this.jwtService.sign({ sub: user.id, email: user.email }) };
-  }
+  async register(dto: RegisterDto): Promise<{ access_token: string }> {}
 
   async login(dto: LoginDto): Promise<{ access_token: string }> {
killedBy: AuthService Integration Tests register creates a user in the database and returns a signed JWT
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/auth/auth.service.ts:19:9
 
   async register(dto: RegisterDto): Promise<{ access_token: string }> {
     const existing = await this.usersService.findByEmail(dto.email);
-    if (existing) throw new ConflictException('Email already registered');
+    if (true) throw new ConflictException('Email already registered');
 
     const passwordHash = await bcrypt.hash(dto.password, SALT_ROUNDS);
killedBy: Tasks E2E Authenticated CRUD POST /tasks with valid body → 201 with task shape
statusReason: expected 401 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/auth/auth.service.ts:19:9
 
   async register(dto: RegisterDto): Promise<{ access_token: string }> {
     const existing = await this.usersService.findByEmail(dto.email);
-    if (existing) throw new ConflictException('Email already registered');
+    if (false) throw new ConflictException('Email already registered');
 
     const passwordHash = await bcrypt.hash(dto.password, SALT_ROUNDS);
killedBy: Auth E2E POST /auth/register returns 409 when email is already registered
statusReason: expected 500 to be 409 // Object.is equality

[Killed] BlockStatement
src/auth/auth.service.ts:27:65
     return { access_token: this.jwtService.sign({ sub: user.id, email: user.email }) };
   }
 
-  async login(dto: LoginDto): Promise<{ access_token: string }> {
-    const user = await this.usersService.findByEmail(dto.email);
-    if (!user) throw new UnauthorizedException('Invalid credentials');
-
-    const passwordMatch = await bcrypt.compare(dto.password, user.passwordHash);
-    if (!passwordMatch) throw new UnauthorizedException('Invalid credentials');
-
-    return { access_token: this.jwtService.sign({ sub: user.id, email: user.email }) };
-  }
+  async login(dto: LoginDto): Promise<{ access_token: string }> {}
 }
 
killedBy: AuthService Integration Tests login returns a signed JWT for valid credentials
statusReason: Cannot convert undefined or null to object

[Killed] ConditionalExpression
src/auth/auth.service.ts:29:9
 
   async login(dto: LoginDto): Promise<{ access_token: string }> {
     const user = await this.usersService.findByEmail(dto.email);
-    if (!user) throw new UnauthorizedException('Invalid credentials');
+    if (false) throw new UnauthorizedException('Invalid credentials');
 
     const passwordMatch = await bcrypt.compare(dto.password, user.passwordHash);
killedBy: AuthService Integration Tests login throws UnauthorizedException for an unknown email
statusReason: expected error to be instance of UnauthorizedException

[Killed] BooleanLiteral
src/auth/auth.service.ts:29:9
 
   async login(dto: LoginDto): Promise<{ access_token: string }> {
     const user = await this.usersService.findByEmail(dto.email);
-    if (!user) throw new UnauthorizedException('Invalid credentials');
+    if (user) throw new UnauthorizedException('Invalid credentials');
 
     const passwordMatch = await bcrypt.compare(dto.password, user.passwordHash);
killedBy: AuthService Integration Tests login returns a signed JWT for valid credentials
statusReason: Invalid credentials

[Killed] BooleanLiteral
src/auth/auth.service.ts:32:9
     if (!user) throw new UnauthorizedException('Invalid credentials');
 
     const passwordMatch = await bcrypt.compare(dto.password, user.passwordHash);
-    if (!passwordMatch) throw new UnauthorizedException('Invalid credentials');
+    if (passwordMatch) throw new UnauthorizedException('Invalid credentials');
 
     return { access_token: this.jwtService.sign({ sub: user.id, email: user.email }) };
killedBy: AuthService Integration Tests login returns a signed JWT for valid credentials
statusReason: Invalid credentials

[Killed] ConditionalExpression
src/auth/auth.service.ts:32:9
     if (!user) throw new UnauthorizedException('Invalid credentials');
 
     const passwordMatch = await bcrypt.compare(dto.password, user.passwordHash);
-    if (!passwordMatch) throw new UnauthorizedException('Invalid credentials');
+    if (true) throw new UnauthorizedException('Invalid credentials');
 
     return { access_token: this.jwtService.sign({ sub: user.id, email: user.email }) };
killedBy: AuthService Integration Tests login returns a signed JWT for valid credentials
statusReason: Invalid credentials
