[Survived] StringLiteral
src/tasks/tasks.service.ts:18:16
       page = 1,
       limit = 10,
       search,
-      sortBy = 'createdAt',
+      sortBy = "",
       sortOrder = 'desc',
       completed,

[Killed] BlockStatement
src/tasks/tasks.service.ts:26:17
 
     const conditions: SQL[] = [];
 
-    if (search) {
-      conditions.push(
-        or(
-          ilike(tasks.title, `%${search}%`),
-          ilike(tasks.description, `%${search}%`),
-        ) as SQL,
-      );
-    }
+    if (search) {}
 
     if (completed !== undefined) {
killedBy: TasksService Integration Tests getTasks excludes non-matching tasks when search term is provided
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:35:9
       );
     }
 
-    if (completed !== undefined) {
+    if (false) {
       conditions.push(eq(tasks.completed, completed));
     }
killedBy: TasksService Integration Tests getTasks filters by completed status
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:35:9
       );
     }
 
-    if (completed !== undefined) {
+    if (true) {
       conditions.push(eq(tasks.completed, completed));
     }
killedBy: TasksService Integration Tests getTasks filters by search term in title
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:39:9
       conditions.push(eq(tasks.completed, completed));
     }
 
-    if (priority !== undefined) {
+    if (priority === undefined) {
       conditions.push(eq(tasks.priority, priority));
     }
killedBy: TasksService Integration Tests getTasks filters by search term in title
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:39:9
       conditions.push(eq(tasks.completed, completed));
     }
 
-    if (priority !== undefined) {
+    if (false) {
       conditions.push(eq(tasks.priority, priority));
     }
killedBy: TasksService Integration Tests priority — getTasks returns only Low priority tasks when priority filter is Low
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:51:7
       .where(where);
 
     const sortColumn =
-      sortBy === 'title'
+      sortBy !== 'title'
         ? tasks.title
         : sortBy === 'priority'
killedBy: TasksService Integration Tests getTasks sorts by title ascending using tasks with different priorities
statusReason: expected 'titlesort-1780477688284 Zebra' to contain 'Alpha'

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:51:7
       .where(where);
 
     const sortColumn =
-      sortBy === 'title'
+      false
         ? tasks.title
         : sortBy === 'priority'
killedBy: TasksService Integration Tests getTasks sorts by title ascending using tasks with different priorities
statusReason: expected 'titlesort-1780477687906 Zebra' to contain 'Alpha'

[Killed] EqualityOperator
src/tasks/tasks.service.ts:53:11
     const sortColumn =
       sortBy === 'title'
         ? tasks.title
-        : sortBy === 'priority'
+        : sortBy !== 'priority'
           ? tasks.priority
           : tasks.createdAt;
killedBy: TasksService Integration Tests getTasks paginates: page 2 returns different items than page 1
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:53:11
     const sortColumn =
       sortBy === 'title'
         ? tasks.title
-        : sortBy === 'priority'
+        : true
           ? tasks.priority
           : tasks.createdAt;
killedBy: TasksService Integration Tests getTasks paginates: page 2 returns different items than page 1
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:56:21
         : sortBy === 'priority'
           ? tasks.priority
           : tasks.createdAt;
-    const orderFn = sortOrder === 'asc' ? asc : desc;
+    const orderFn = false ? asc : desc;
 
     const data = await db
killedBy: TasksService Integration Tests getTasks sorts by title ascending using tasks with different priorities
statusReason: expected 'titlesort-1780477691051 Zebra' to contain 'Alpha'

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:56:21
         : sortBy === 'priority'
           ? tasks.priority
           : tasks.createdAt;
-    const orderFn = sortOrder === 'asc' ? asc : desc;
+    const orderFn = true ? asc : desc;
 
     const data = await db
killedBy: TasksService Integration Tests getTasks sorts by title descending
statusReason: expected [ 'Aardvark task', …(12) ] to deeply equal [ 'Zeppelin task', …(12) ]

[Killed] ArithmeticOperator
src/tasks/tasks.service.ts:64:15
       .where(where)
       .orderBy(orderFn(sortColumn))
       .limit(limit)
-      .offset((page - 1) * limit);
+      .offset((page - 1) / limit);
 
     return {
killedBy: TasksService Integration Tests getTasks paginates: page 2 returns different items than page 1
statusReason: Failed query: select "id", "title", "description", "completed", "created_at", "priority" from "tasks" order by "tasks"."created_at" desc limit $1 offset $2
params: 2,0.5

[Killed] ArithmeticOperator
src/tasks/tasks.service.ts:64:16
       .where(where)
       .orderBy(orderFn(sortColumn))
       .limit(limit)
-      .offset((page - 1) * limit);
+      .offset((page + 1) * limit);
 
     return {
killedBy: TasksService Integration Tests getTasks filters by search term in title
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/tasks/tasks.service.ts:68:13
 
     return {
       data,
-      meta: {
-        page,
-        limit,
-        total,
-        totalPages: Math.ceil(total / limit),
-      },
+      meta: {},
     };
   }
killedBy: TasksService Integration Tests getTasks returns an array with pagination meta
statusReason: expected {} to match object { page: Any<Number>, …(3) }

[Killed] ArithmeticOperator
src/tasks/tasks.service.ts:72:31
         page,
         limit,
         total,
-        totalPages: Math.ceil(total / limit),
+        totalPages: Math.ceil(total * limit),
       },
     };
killedBy: TasksService Unit Tests getTasks returns paginated data with meta using defaults
statusReason: expected { page: 1, limit: 10, total: 1, …(1) } to deeply equal { page: 1, limit: 10, total: 1, …(1) }

[Killed] BlockStatement
src/tasks/tasks.service.ts:77:33
     };
   }
 
-  async getTaskById(id: number) {
-    const result = await db.select().from(tasks).where(eq(tasks.id, id));
-    const task = result[0];
-
-    if (!task) {
-      throw new NotFoundException(`Task with id ${id} not found`);
-    }
-
-    return task;
-  }
+  async getTaskById(id: number) {}
 
   async createTask(dto: CreateTaskDto) {
killedBy: TasksService Integration Tests getTaskById returns the task when it exists
statusReason: expected undefined to deeply equal { id: 1589, title: 'Find me', …(4) }

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:81:9
     const result = await db.select().from(tasks).where(eq(tasks.id, id));
     const task = result[0];
 
-    if (!task) {
+    if (false) {
       throw new NotFoundException(`Task with id ${id} not found`);
     }
killedBy: TasksService Unit Tests getTaskById throws NotFoundException when task does not exist
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/tasks/tasks.service.ts:81:9
     const result = await db.select().from(tasks).where(eq(tasks.id, id));
     const task = result[0];
 
-    if (!task) {
+    if (task) {
       throw new NotFoundException(`Task with id ${id} not found`);
     }
killedBy: TasksService Integration Tests getTaskById returns the task when it exists
statusReason: Task with id 1590 not found

[Killed] BlockStatement
src/tasks/tasks.service.ts:88:40
     return task;
   }
 
-  async createTask(dto: CreateTaskDto) {
-    const [newTask] = await db
-      .insert(tasks)
-      .values({
-        title: dto.title,
-        description: dto.description,
-        priority: dto.priority,
-      })
-      .returning();
-
-    return newTask;
-  }
+  async createTask(dto: CreateTaskDto) {}
 
   async updateTask(id: number, dto: UpdateTaskDto) {
killedBy: TasksService Unit Tests createTask inserts and returns a new task with title only
statusReason: expected undefined to deeply equal { id: 1, title: 'New task', …(4) }

[Killed] BlockStatement
src/tasks/tasks.service.ts:101:52
     return newTask;
   }
 
-  async updateTask(id: number, dto: UpdateTaskDto) {
-    await this.getTaskById(id);
-
-    const updateData: Record<string, unknown> = {};
-    if (dto.title !== undefined) updateData.title = dto.title;
-    if (dto.description !== undefined) updateData.description = dto.description;
-    if (dto.completed !== undefined) updateData.completed = dto.completed;
-    if (dto.priority !== undefined) updateData.priority = dto.priority;
-
-    const [updatedTask] = await db
-      .update(tasks)
-      .set(updateData)
-      .where(eq(tasks.id, id))
-      .returning();
-
-    return updatedTask;
-  }
+  async updateTask(id: number, dto: UpdateTaskDto) {}
 
   async deleteTask(id: number) {
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:105:9
     await this.getTaskById(id);
 
     const updateData: Record<string, unknown> = {};
-    if (dto.title !== undefined) updateData.title = dto.title;
+    if (true) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:105:9
     await this.getTaskById(id);
 
     const updateData: Record<string, unknown> = {};
-    if (dto.title !== undefined) updateData.title = dto.title;
+    if (dto.title === undefined) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:106:9
 
     const updateData: Record<string, unknown> = {};
     if (dto.title !== undefined) updateData.title = dto.title;
-    if (dto.description !== undefined) updateData.description = dto.description;
+    if (true) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
     if (dto.priority !== undefined) updateData.priority = dto.priority;
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:106:9
 
     const updateData: Record<string, unknown> = {};
     if (dto.title !== undefined) updateData.title = dto.title;
-    if (dto.description !== undefined) updateData.description = dto.description;
+    if (dto.description === undefined) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
     if (dto.priority !== undefined) updateData.priority = dto.priority;
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:107:9
     const updateData: Record<string, unknown> = {};
     if (dto.title !== undefined) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
-    if (dto.completed !== undefined) updateData.completed = dto.completed;
+    if (dto.completed === undefined) updateData.completed = dto.completed;
     if (dto.priority !== undefined) updateData.priority = dto.priority;
 
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:107:9
     const updateData: Record<string, unknown> = {};
     if (dto.title !== undefined) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
-    if (dto.completed !== undefined) updateData.completed = dto.completed;
+    if (false) updateData.completed = dto.completed;
     if (dto.priority !== undefined) updateData.priority = dto.priority;
 
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/tasks/tasks.service.ts:108:9
     if (dto.title !== undefined) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
-    if (dto.priority !== undefined) updateData.priority = dto.priority;
+    if (false) updateData.priority = dto.priority;
 
     const [updatedTask] = await db
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] EqualityOperator
src/tasks/tasks.service.ts:108:9
     if (dto.title !== undefined) updateData.title = dto.title;
     if (dto.description !== undefined) updateData.description = dto.description;
     if (dto.completed !== undefined) updateData.completed = dto.completed;
-    if (dto.priority !== undefined) updateData.priority = dto.priority;
+    if (dto.priority === undefined) updateData.priority = dto.priority;
 
     const [updatedTask] = await db
killedBy: Tasks E2E Authenticated CRUD PATCH /tasks/:id with { completed: true } → 200 with completed = true
statusReason: expected 400 to be 200 // Object.is equality

[Killed] BlockStatement
src/tasks/tasks.service.ts:119:32
     return updatedTask;
   }
 
-  async deleteTask(id: number) {
-    const task = await this.getTaskById(id);
-    await db.delete(tasks).where(eq(tasks.id, id));
-    return task;
-  }
+  async deleteTask(id: number) {}
 
   async deleteTasksInBatch(dto: BulkDeleteDto) {
killedBy: Tasks E2E Authenticated CRUD DELETE /tasks/:id → 200 returns the deleted task
statusReason: expected undefined to be 1596 // Object.is equality

[Killed] BlockStatement
src/tasks/tasks.service.ts:125:48
     return task;
   }
 
-  async deleteTasksInBatch(dto: BulkDeleteDto) {
-    const deletedTasks: (typeof tasks.$inferSelect)[] = [];
-
-    await db.transaction(async (tx) => {
-      for (const id of dto.ids) {
-        const result = await tx.select().from(tasks).where(eq(tasks.id, id));
-        const task = result[0];
-
-        if (!task) {
-          throw new NotFoundException(`Task with id ${id} not found`);
-        }
-
-        await tx.delete(tasks).where(eq(tasks.id, id));
-        deletedTasks.push(task);
-      }
-    });
-
-    return deletedTasks;
-  }
+  async deleteTasksInBatch(dto: BulkDeleteDto) {}
 }
 
killedBy: TasksService Integration Tests deleteTasksInBatch deletes multiple tasks atomically and returns them
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/tasks/tasks.service.ts:128:40
   async deleteTasksInBatch(dto: BulkDeleteDto) {
     const deletedTasks: (typeof tasks.$inferSelect)[] = [];
 
-    await db.transaction(async (tx) => {
-      for (const id of dto.ids) {
-        const result = await tx.select().from(tasks).where(eq(tasks.id, id));
-        const task = result[0];
-
-        if (!task) {
-          throw new NotFoundException(`Task with id ${id} not found`);
-        }
-
-        await tx.delete(tasks).where(eq(tasks.id, id));
-        deletedTasks.push(task);
-      }
-    });
+    await db.transaction(async (tx) => {});
 
     return deletedTasks;
killedBy: TasksService Integration Tests deleteTasksInBatch deletes multiple tasks atomically and returns them
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/tasks/tasks.service.ts:129:33
     const deletedTasks: (typeof tasks.$inferSelect)[] = [];
 
     await db.transaction(async (tx) => {
-      for (const id of dto.ids) {
-        const result = await tx.select().from(tasks).where(eq(tasks.id, id));
-        const task = result[0];
-
-        if (!task) {
-          throw new NotFoundException(`Task with id ${id} not found`);
-        }
-
-        await tx.delete(tasks).where(eq(tasks.id, id));
-        deletedTasks.push(task);
-      }
+      for (const id of dto.ids) {}
     });
 
killedBy: TasksService Integration Tests deleteTasksInBatch deletes multiple tasks atomically and returns them
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/tasks/tasks.service.ts:133:20
         const result = await tx.select().from(tasks).where(eq(tasks.id, id));
         const task = result[0];
 
-        if (!task) {
-          throw new NotFoundException(`Task with id ${id} not found`);
-        }
+        if (!task) {}
 
         await tx.delete(tasks).where(eq(tasks.id, id));
killedBy: TasksService Integration Tests deleteTasksInBatch throws and rolls back when any id is not found
statusReason: promise resolved "[ { id: 1612, …(5) }, undefined ]" instead of rejecting

[Survived] StringLiteral
src/tasks/tasks.service.ts:134:39
         const task = result[0];
 
         if (!task) {
-          throw new NotFoundException(`Task with id ${id} not found`);
+          throw new NotFoundException(``);
         }
 
