[Killed] BlockStatement
src/users/users.service.ts:10:63
 
 @Injectable()
 export class UsersService {
-  async findByEmail(email: string): Promise<User | undefined> {
-    const [user] = await db.select().from(users).where(eq(users.email, email));
-    return user;
-  }
+  async findByEmail(email: string): Promise<User | undefined> {}
 
   async create(email: string, passwordHash: string): Promise<User> {
killedBy: Auth E2E POST /auth/register returns 409 when email is already registered
statusReason: expected 500 to be 409 // Object.is equality

[Killed] BlockStatement
src/users/users.service.ts:15:68
     return user;
   }
 
-  async create(email: string, passwordHash: string): Promise<User> {
-    const [user] = await db.insert(users).values({ email, passwordHash }).returning();
-    return user;
-  }
+  async create(email: string, passwordHash: string): Promise<User> {}
 }
 
killedBy: Auth E2E POST /auth/register returns 201 with access_token for valid credentials
statusReason: expected 500 to be 201 // Object.is equality
